package com.kviuff.common;

import java.util.ArrayList;
import java.util.UUID;

/**
 * 封装各种生成唯一性ID算法的工具类.
 * 
 * @author kviuff Created by on 16/1/6.
 */
public class IdGen {

	/**
	 * 封装JDK自带的UUID, 通过Random数字生成, 中间无-分割.
	 */
	public static String uuid() {
		return UUID.randomUUID().toString().replaceAll("-", "");
	}

	public static void main(String[] args) {
//    	String aa = "DMC冻膜500g+城野医生收敛水100ml,Ray银色蚕丝【10片/盒】,【水库滋润水200ml】,10片/一盒,【收缩毛孔黑色】,【温和洗面奶591ml】,JM蜂蜜面膜+深水面膜,【婴儿肌保湿面膜】,金色两盒20片,金色面膜10片1盒,【水光蜂蜜面膜】,胎盘鱼子酱面膜10片,【黑珍珠透净白10片】,【3D美白保湿蓝色】,【玻尿酸三部曲面膜】,动物黄熊EGT抗皱修护面膜10片,冻膜【225g】+城野医生毛孔收敛水收缩三件套装,【滋盈水乳三件套】,【3D胶原蛋白玫红】,冰凝叶子面膜10片,【氨基酸紧致提拉10片】,水光针急救补水面膜10片/盒,基因再生桃花面膜5片,【樱花焕白滋养三部曲10片】,紫色RNA面膜10片,【玉容撕拉面膜150ml】,【四合一洗面奶180ml】,金色保湿修护十片装,金盏花夜间修复面膜5片,安娜贝拉海藻套盒5件套,【人参水乳两件套】,【氨基酸细致毛孔10片】,【雨润睡眠面膜120ml】,E.G.T弹性紧致10片,冻膜【225g】+泰国去黑头鼻贴【22g】,JM润光玫瑰精油面膜10片/盒,酸奶面膜,DMC冻膜225g,金银套装【金色10片银色10片】,【水库凝肌精华露60ml】,蜂蜜JM面膜10片/盒玻尿酸精华补水保湿,【艳肌蓝色4片】,竹炭提亮面膜10片,【夜间睡眠面膜70ml】,jm珍珠防晒喷雾180ml,【玻尿酸保湿红色】,【B5系列水光面膜套装】,银色五片装,【玫瑰果冻面膜3片】,JM蚕丝面膜5片,【滋盈水乳两件套免税店版】,JM深水水光针剂急救面膜10片/盒,水光三部曲面膜眼霜面霜10片,5片,【氨基酸清洁保湿10片】,蜂胶蜂蜜面膜10片/1盒,金色+银色各一片,【水库滋润乳120ml】,【维C提亮面膜】,一片试用装,JM大米面膜10片/盒,DMC冻膜35g,动物绿鸭PDF舒缓祛痘面膜10片,20片/两盒,【冰凉竹子面膜】,【海洋珍珠面膜】,【氨基酸深层补水10片】,【黄金果冻玻尿酸3片】,冻膜【225g】+城野医生毛孔收敛水收缩毛孔,动物粉兔IPI清澈透亮面膜10片,【经典燕窝水库10片】,粉碳细致毛孔10片,两盒特惠装,银色10片装,绿色APE面膜10片,金色保湿修护五片装,【金色蜂王浆3片装】,【B5玻尿酸补水面膜三代】,【温和润肤霜566g】,动物蓝色NMF水库补水面膜10片,冻膜【500g】+泰国去黑头鼻贴【22g】,金色妆蕾版两盒装,N.M.F针剂水库10片,【保湿润肤露591ml】,【保湿乳】,蜂胶蜂蜜+黄金蚕丝面膜组合,海洋珍珠三部曲面膜10片/盒,【撕拉面膜+布丁面膜】,竹炭泡泡面膜10片,【熊猫嫩白润肤10片】,10片/盒,【艳肌绿色4片】,金色试用装一片,冻膜【500g】+城野医生毛孔收敛水收缩三件套装,【3D玻尿酸保湿橙色】,金色蚕丝面膜,【顺行洗面奶200ml】,【黑色卢卡面膜黑色】,银色妆蕾版10片/盒,【氨基酸蜗牛祛痘10片】,【防晒隔离霜】,【黄金胶原蛋白10片】,WHP竹炭黑炭面膜10片,赠品勿拍面膜1片,【玫瑰精华提亮舒缓10片】,银色面膜10片1盒,银色妆蕾版两盒装,安娜贝拉海藻防晒喷雾,银色蚕丝面膜,黄金蚕丝面膜10片/盒,【洁面泡沫】,泰国ANNABELLA安娜贝拉海藻面膜20片两盒,【防雾霾透白修护三部曲10片】,【300ml】,蓝色DNA面膜10片,金色保湿修护一片装,【竹炭细致毛孔10片】,Ray金色面膜【10片/盒】,【滋阴两件套专柜版】,【黑眼膜眼贴】,【维生素保湿紧致10片】,【蓝色胶原蛋白3片装】,美颜面膜10片,赠品勿拍洗脸扑1个,红色PEP面膜10片,蜂胶蜂蜜面膜20片,【宫中秘皂】,创意随身镜,胶原蛋白面膜10片,金银套装金色10片银色10片,【玫瑰面膜粉色】,【面膜贴】,DMC冻膜500g,jm欧若拉樱花面膜10片/盒,牛油果精油面膜10片/盒,金色妆蕾版10片/盒,【玻尿酸睡眠面膜】,【爆款蓝色补水保湿】,【水光急救面膜】,补水嫩白面膜10片,【滋盈平衡乳125ml】,【老虎保湿抗皱10片】,ray面膜3盒装（金银自选）,黄金蚕丝JM面膜10片/盒蛋白精华补水保湿,老虎面膜,【植物干细胞补水10片】,银色嫩白保湿十片装,【安瓶嫩白精华10片】,【婴儿肌玻尿酸面膜】,【红参面膜】,JM深水急救面膜5片,【艳肌紫色4片】,【珍雪水乳两件套】,JM蜂蜜面膜5片,DMC冻膜225g+城野医生收敛水100ml,【PCG胶原蛋白面膜】,金色5片+银色5片混搭,【蚕丝精华面膜】,JM海洋珍珠面膜三部曲新品,【B5玻尿酸面膜一代经典款】,金色10片,金色10片+银色10片套装,【高端之选黄金锡纸面膜】,【嫩白提亮面膜白色】,【润燥精华60ml】,【防雾霾镇定修护三部曲10片】,【小蜜罐面膜限量款】,银色两盒20片,DMC冻膜225g+城野水100ml+化妆棉40抽,NMF水库针剂面膜10片,【经典蜂蜜补水保湿面膜黄色】,银色金色各一盒,妆蕾版金色银色各一盒共20片,【爆款绿色补水保湿】,欧若拉樱花面膜10片/盒,灰常干净洗面奶80g洗颜乳氨基酸弱酸性,【补水美白蓝色】,金色5片装,JM海洋珍珠面膜5片,【海豹补水嫩白10片】,银色试用装一片,【化妆水】,【50ml】,JM蜂蜜面膜+JM珍珠面膜各一盒,DMC冻膜35g*7包,P.D.F舒缓祛痘10片";
//        //System.out.println(IdGen.uuid());
//        
//        String[] bb = aa.split(",");
//        for (String str : bb) {
//        	StringBuffer oneStr = new StringBuffer();
//            oneStr.append("insert into shop_spec_value (sp_value_id,sp_value_name,sp_id,sp_value_sort)");
//            oneStr.append("values ('" + IdGen.uuid() + "','" + str + "','3f38f6e6f2f94cb6bf314265c9c1c9d6','255');");
//            System.out.println(oneStr.toString());
//        }
        
    }
}
